# NullParameterValue Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NullParameterValue Class
Members See Also
---
A class that represent an empty (null) value of a parameter element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public class NullParameterValue : ParameterValue
```

Visual Basic
---
```text
Public Class NullParameterValue _
	Inherits ParameterValue
```

Visual C++
---
```text
public ref class NullParameterValue : public ParameterValue
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ParameterValue Autodesk.Revit.DB..::..NullParameterValue
# See Also
NullParameterValue Members
Autodesk.Revit.DB Namespace